### AI-03 quiz

#### Import libraries

In [47]:
import numpy as np
import pandas as pd

#### Parameters

In [48]:
csv_in = 'running.csv'

In [49]:
df = pd.read_csv(csv_in, delimiter=',', skiprows=0, header=0)
print(df.shape)
print(df.info())
display(df.head())

(50, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
ID       50 non-null int64
Univ     48 non-null object
Grade    50 non-null int64
Time     49 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1002  NaN      2  1937.0
2  1003  NaN      1  2036.0
3  1004    C      1  1957.0
4  1005    D      1     NaN

#### Drop missing values

In [50]:
#df2 = df.dropna(axis=0); display(df2)
#df2 = df.dropna(axis=0).reset_index(); display(df2)
df2 = df.dropna(axis=0).reset_index(drop=True)
display(df2.head(10))

     ID Univ  Grade    Time
0  1001    D      3  1870.0
1  1004    C      1  1957.0
2  1006    D      2  2063.0
3  1007    D      3  1839.0
4  1008    C      2  1740.0
5  1009    B      3  2082.0
6  1010    C      4  2045.0
7  1011    A      3  1818.0
8  1012    A      3  1783.0
9  1013    A      2  1965.0

In [51]:
df3 = df2[ (df2['Univ']!='C') & (df2['Grade']<=3) ]
print(df3.shape)
display(df3.head(10))

(31, 4)

      ID Univ  Grade    Time
0   1001    D      3  1870.0
2   1006    D      2  2063.0
3   1007    D      3  1839.0
5   1009    B      3  2082.0
7   1011    A      3  1818.0
8   1012    A      3  1783.0
9   1013    A      2  1965.0
10  1014    D      1  1803.0
11  1015    A      2  2123.0
14  1018    D      1  1926.0

In [52]:
display(df3.loc[df3['Time'].idxmin()])

ID       1030
Univ        D
Grade       3
Time     1761
Name: 26, dtype: object